package com.candyenk.demo.activity;

import android.widget.EditText;
import androidx.recyclerview.widget.LinearLayoutManager;
import candyenk.android.base.ActivityCDK;
import candyenk.android.tools.V;
import candyenk.android.widget.*;
import com.candyenk.demo.R;
import com.candyenk.demo.databinding.DialogTestBinding;

import java.io.File;

public class DialogTest extends ActivityCDK.Default {
    
    @Override
    protected void viewInit() {
        DialogTestBinding db = DialogTestBinding.inflate(getLayoutInflater());
        setContentView(db.getRoot());
        db.b1.setOnClickListener(v -> {
            DialogBottomView b = new DialogBottomView(v);
            EditText iv = new EditText(this);
            V.ML(iv).sizeDP(-1, -2).marginDP(10, 20, 10, 20).refresh();
            b.setContent(iv);
            b.setTitle("自定义View弹窗测试");
            b.setShowClose(true);
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.show();
        });
        db.b11.setOnClickListener(v -> {
            DialogBottomItem b = new DialogBottomItem(v);
            b.setContent(R.layout.nv_test, 10);
            b.setTitle("自定义Item弹窗测试");
            b.setShowClose(true);
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.show();
        });
        db.b2.setOnClickListener(v -> {
            DialogBottomItem b = new DialogBottomItem(v);
            b.setContent(R.layout.nv_test, 10);
            b.setTitle("自定义Item横向弹窗测试");
            b.setShowClose(true);
            b.setLayoutManager(new LinearLayoutManager(this, LinearLayoutManager.HORIZONTAL, false));
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.show();
        });
        db.b22.setOnClickListener(v -> {
            DialogBottomItemText b = new DialogBottomItemText(v);
            b.setTitle("文本Item弹窗测试");
            b.setShowClose(true);
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.setContent("天地玄黄，宇宙洪荒", "日月盈昃，辰宿列张", "寒来暑往，秋收冬藏", "闰余成岁，律吕调阳",
                    "云腾致雨，露结为霜", "金生丽水，玉出昆冈", "剑号巨阙，珠称夜光", "果珍李柰，菜重芥姜",
                    "海咸河淡，鳞潜羽翔", "龙师火帝，鸟官人皇", "始制文字，乃服衣裳", "推位让国，有虞陶唐",
                    "吊民伐罪，周发殷汤", "坐朝问道，垂拱平章", "爱育黎首，臣伏戎羌", "遐迩一体，率宾归王",
                    "鸣凤在竹，白驹食场", "化被草木，赖及万方", "盖此身发，四大五常", "恭惟鞠养，岂敢毁伤",
                    "女慕贞洁，男效才良", "知过必改，得能莫忘", "罔谈彼短，靡恃己长", "信使可覆，器欲难量",
                    "墨悲丝染，诗赞羔羊", "景行维贤，克念作圣", "德建名立，形端表正", "空谷传声，虚堂习听",
                    "祸因恶积，福缘善庆", "尺璧非宝，寸阴是竞", "资父事君，曰严与敬", "孝当竭力，忠则尽命",
                    "临深履薄，夙兴温凊", "似兰斯馨，如松之盛", "川流不息，渊澄取映", "容止若思，言辞安定",
                    "笃初诚美，慎终宜令", "荣业所基，籍甚无竟", "学优登仕，摄职从政", "存以甘棠，去而益咏",
                    "乐殊贵贱，礼别尊卑", "上和下睦，夫唱妇随", "外受傅训，入奉母仪", "诸姑伯叔，犹子比儿",
                    "孔怀兄弟，同气连枝", "交友投分，切磨箴规", "仁慈隐恻，造次弗离", "节义廉退，颠沛匪亏",
                    "性静情逸，心动神疲", "守真志满，逐物意移", "坚持雅操，好爵自縻", "都邑华夏，东西二京",
                    "背邙面洛，浮渭据泾", "宫殿盘郁，楼观飞惊", "图写禽兽，画彩仙灵", "丙舍旁启，甲帐对楹",
                    "肆筵设席，鼓瑟吹笙", "升阶纳陛，弁转疑星", "右通广内，左达承明", "既集坟典，亦聚群英",
                    "杜稿钟隶，漆书壁经", "府罗将相，路侠槐卿", "户封八县，家给千兵", "高冠陪辇，驱毂振缨",
                    "世禄侈富，车驾肥轻", "策功茂实，勒碑刻铭", "磻溪伊尹，佐时阿衡", "奄宅曲阜，微旦孰营",
                    "桓公匡合，济弱扶倾", "绮回汉惠，说感武丁", "俊乂密勿，多士寔宁", "晋楚更霸，赵魏困横",
                    "假途灭虢，践土会盟", "何遵约法，韩弊烦刑", "起翦颇牧，用军最精", "宣威沙漠，驰誉丹青",
                    "九州禹迹，百郡秦并", "岳宗泰岱，禅主云亭", "雁门紫塞，鸡田赤城", "昆池碣石，钜野洞庭",
                    "旷远绵邈，岩岫杳冥", "治本于农，务兹稼穑", "俶载南亩，我艺黍稷", "税熟贡新，劝赏黜陟",
                    "孟轲敦素，史鱼秉直", "庶几中庸，劳谦谨敕", "聆音察理，鉴貌辨色", "贻厥嘉猷，勉其祗植",
                    "省躬讥诫，宠增抗极", "殆辱近耻，林皋幸即", "两疏见机，解组谁逼", "索居闲处，沉默寂寥",
                    "求古寻论，散虑逍遥", "欣奏累遣，戚谢欢招", "渠荷的历，园莽抽条", "枇杷晚翠，梧桐蚤凋",
                    "陈根委翳，落叶飘摇", "游鹍独运，凌摩绛霄", "耽读玩市，寓目囊箱", "易輶攸畏，属耳垣墙",
                    "具膳餐饭，适口充肠", "饱饫烹宰，饥厌糟糠", "亲戚故旧，老少异粮", "妾御绩纺，侍巾帷房",
                    "纨扇圆絜，银烛炜煌", "昼眠夕寐，蓝笋象床", "弦歌酒宴，接杯举觞", "矫手顿足，悦豫且康",
                    "嫡后嗣续，祭祀烝尝", "稽颡再拜，悚惧恐惶", "笺牒简要，顾答审详", "骸垢想浴，执热愿凉",
                    "驴骡犊特，骇跃超骧", "诛斩贼盗，捕获叛亡", "布射僚丸，嵇琴阮啸", "恬笔伦纸，钧巧任钓",
                    "释纷利俗，并皆佳妙", "毛施淑姿，工颦妍笑", "年矢每催，曦晖朗曜", "璇玑悬斡，晦魄环照",
                    "指薪修祜，永绥吉劭", "矩步引领，俯仰廊庙", "束带矜庄，徘徊瞻眺", "孤陋寡闻，愚蒙等诮",
                    "谓语助者，焉哉乎也");
            b.show();
        });
        
        db.b3.setOnClickListener(v -> {
            DialogBottomText b = new DialogBottomText(v);
            b.setTitle("纯文本弹窗测试");
            b.setShowClose(true);
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.setContent(
                    "壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。\n" +
                            "\n" +
                            "　　于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。\n" +
                            "\n" +
                            "　　苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞’，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”\n" +
                            "\n" +
                            "　　苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”(共适 一作：共食)\n" +
                            "\n" +
                            "　　客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。\n" +
                            "\n" +
                            "　　于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。\n" +
                            "\n" +
                            "　　苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞’，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”\n" +
                            "\n" +
                            "　　苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”(共适 一作：共食)\n" +
                            "\n" +
                            "　　客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。\n" +
                            "\n" +
                            "　　于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。\n" +
                            "\n" +
                            "　　苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞’，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”\n" +
                            "\n" +
                            "　　苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”(共适 一作：共食)\n" +
                            "\n" +
                            "　　客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。\n" +
                            "\n" +
                            "　　于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。\n" +
                            "\n" +
                            "　　苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞’，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”\n" +
                            "\n" +
                            "　　苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”(共适 一作：共食)\n" +
                            "\n" +
                            "　　客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。");
            b.show();
        });
        
        db.b33.setOnClickListener(v -> {
            DialogBottomTips b = new DialogBottomTips(v);
            // b.setTitle("提示弹窗测试");
            b.setContent("千字文背会了吗?没有??那还不快去背!!!");
            b.show();
        });
        
        db.b4.setOnClickListener(v -> {
            DialogBottomConfirm b = new DialogBottomConfirm(v);
            //b.setTitle("确认弹窗测试");
            b.setIcon(candyenk.android.R.drawable.aaa);
            b.setOnEventCallBack(new DialogBottomConfirm.OnEventCallBack() {
                @Override
                public void onYse() {
                    toast("确认了");
                }
                
                @Override
                public void onNo() {
                    toast("没确认");
                }
            });
            b.setContent("请确认千字文是否已背诵!");
            b.show();
        });
        
        db.b44.setOnClickListener(v -> {
            DialogFileChooser b = new DialogFileChooser(this, new File("/sdcard"));
            b.setLeftButton(null, d -> toast("确认"), null);
            b.setRightButton(null, d -> toast("取消"), null);
            b.show();
        });
        db.b5.setOnClickListener(v -> {
            DialogLoading b = new DialogLoading(v);
            b.setTitle("加载中~~~");
            b.setCanceledable(false,true);
            b.show();
            b.getContext().getTheme();
        });
    }
}
